app/controllers/home_controller.rb

INSERT INTO `users` (`name`, `email`, `encrypted_password`, `gender`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)
---
  def register_new_user
    puts "params"
    puts params
    User.create_new_user(params[:user])