app/controllers/ticket_controller.rb

  def book_ticket
    if current_user.present? && MovieScreen.valid_to_book(params[:id])
      ms = MovieScreen.find_by(id: params[:id])
      movie = Movie.find_by(id: ms.movie_id)
---
SELECT  `movie_screens`.* FROM `movie_screens` WHERE `movie_screens`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = ? LIMIT 1  [["id", 1]]